# 1112. Highest Grade For Each Student
[問題](https://leetcode.com/problems/highest-grade-for-each-student/description/?envType=study-plan-v2&envId=premium-sql-50)

## 解答の方針
student_idとcourse_idでグルーピングして、その中のmaxを取り出す。

In [1]:
import pandas as pd

In [37]:
data = [[2, 2, 95], [2, 3, 95], [1, 1, 90], [1, 2, 99], [3, 1, 80], [3, 2, 75], [3, 3, 82]]
enrollments = pd.DataFrame(data, columns=['student_id', 'course_id', 'grade']).astype({'student_id':'Int64', 'course_id':'Int64', 'grade':'Int64'})

In [38]:
enrollments

   student_id  course_id  grade
0           2          2     95
1           2          3     95
2           1          1     90
3           1          2     99
4           3          1     80
5           3          2     75
6           3          3     82

In [46]:
def highest_grade(enrollments: pd.DataFrame) -> pd.DataFrame:
    grouped = enrollments.groupby("student_id")["grade"].max().reset_index()
    merged = enrollments.merge(grouped, on=["student_id", "grade"])
    merged.sort_values(by="course_id", inplace=True)
    merged.drop_duplicates(subset="student_id", inplace=True)
    merged.sort_values(by="student_id", ascending=True, inplace=True)
    return merged

In [47]:
highest_grade(enrollments)

   student_id  course_id  grade
2           1          2     99
0           2          2     95
3           3          3     82

## Test scripts

In [26]:
result = enrollments.groupby("student_id")["grade"].max().reset_index()

In [27]:
result

   student_id  grade
0           1     99
1           2     95
2           3     82

In [28]:
merged = enrollments.merge(result, on=["student_id", "grade"])

In [30]:
merged = merged.sort_values(by="course_id")

In [31]:
merged = merged.drop_duplicates(subset="student_id")

In [32]:
merged

   student_id  course_id  grade
0           2          2     95
2           1          2     99
3           3          3     82

In [34]:
merged = merged.sort_values(by="grade", ascending=False)

In [35]:
merged

   student_id  course_id  grade
2           1          2     99
0           2          2     95
3           3          3     82

### max()とtransform("max")の違い

In [22]:
import pandas as pd

df = pd.DataFrame({
    'Category': ['A', 'B', 'A', 'B'],
    'Value': [10, 20, 30, 40]
})

# グループごとの最大値を計算
max_values = df.groupby('Category')['Value'].max()
max_values

Category
A    30
B    40
Name: Value, dtype: int64

In [23]:
import pandas as pd

df = pd.DataFrame({
    'Category': ['A', 'B', 'A', 'B'],
    'Value': [10, 20, 30, 40]
})

# グループごとの最大値を各行に適用
df['MaxValue'] = df.groupby('Category')['Value'].transform('max')
df

  Category  Value  MaxValue
0        A     10        30
1        B     20        40
2        A     30        30
3        B     40        40